/*
* Реализуйте алгоритм, удаляющий узел из середины односвязного списка. Доступ предоставляется только к этому узлу
*/

#include <iostream>
#include "../my_list.h"

//int main()
//{
//	list<int> my_list;
//	my_list.push_back(30);
//	my_list.push_back(20);
//	my_list.push_back(5);
//	my_list.push_back(10);
//
//	my_list.print();
//	my_list.remove(20);
//	std::cout << "After removing node\n\n";
//	my_list.print();
//
//	return 0;
//}